config/experiments/bash-parser/bash-parser.el
;;; bash-parser.el --- Parse bash commands with tree-sitter -*- lexical-binding: t; -*-

(require 'treesit)

(defvar jf/bash-parser-dangerous-patterns
  '((rm . ((:flags ("-rf" "-fr" "-Rf" "-fR" "-r"))
           (:any-flag-contains ("f" "r"))))
    (git . ((:subcommand "push" :flags ("--force" "-f"))
            (:subcommand "reset" :flags ("--hard"))
            (:subcommand "clean" :flags ("-f" "-fd" "-df"))))
    (docker . ((:subcommand "rm" :flags ("-f" "--force"))))
    (npm . ((:subcommand "uninstall" :flags ("--force"))
            (:subcommand "install" :flags ("--force"))))
    (python . ((:flags ("-c"))
               (:any-flag-contains ("c"))))
    (bash . ((:flags ("-c"))
             (:any-flag-contains ("c"))))
    (sh . ((:flags ("-c"))
           (:any-flag-contains ("c")))))
  "Database of dangerous command patterns.
Format: (command . ((:subcommand \"name\" :flags (list))
                    (:flags (list))
                    (:any-flag-contains (list))))")

(defvar jf/bash-parser-wrapper-commands
  '((sudo . (:flags-with-args ("-u" "-g" "-C" "--close-from" "-D" "-h" "-p" "-R" "-r" "-t" "-T" "-U")
             :flags-no-args ("-A" "-b" "-E" "-e" "-H" "-i" "-K" "-k" "-l" "-n" "-P" "-S" "-s" "-V" "-v")
             :dangerous t))
    (env . (:flags-with-args ("-C" "--chdir" "-S" "--split-string" "-u" "--unset")
            :flags-no-args ("-i" "--ignore-environment" "-0" "--null" "-v" "--debug")
            :dangerous nil))
    (time . (:flags-with-args ("-f" "--format" "-o" "--output")
             :flags-no-args ("-a" "--append" "-v" "--verbose" "-p" "--portability")
             :dangerous nil))
    (nice . (:flags-with-args ("-n" "--adjustment")
             :flags-no-args ()
             :dangerous nil))
    (nohup . (:flags-with-args ()
              :flags-no-args ()
              :dangerous nil)))
  "Database of wrapper commands that execute other commands.
Format: (command . (:flags-with-args (list-of-flags-that-take-arguments)
                    :flags-no-args (list-of-flags-without-arguments)
                    :dangerous t-or-nil))")

(defun jf/bash-parse (command-string)
  "Parse COMMAND-STRING using tree-sitter with full pipeline/chain support.

Returns plist with:
  :success - t if parsing succeeded
  :type - :simple, :pipeline, or :chain
  :all-commands - list of all parsed commands (always present)
  :command-count - number of commands found

For simple commands, also includes (for backward compatibility):
  :command-name - base command
  :subcommand - subcommand if detected
  :flags - list of flags
  :positional-args - list of non-flag arguments
  :dangerous-p - t if command matches dangerous patterns

For pipelines/chains:
  Each element in :all-commands has the same structure as simple commands

Additional fields:
  :ast - tree-sitter root node (for debugging)
  :error - error message if parsing failed"
  (condition-case err
      (jf/bash-parse--internal command-string)
    (error (list :success nil
                 :error (error-message-string err)))))

(defun jf/bash-parse--internal (command-string)
  "Internal parser implementation for COMMAND-STRING with pipeline support."
  (with-temp-buffer
    (insert command-string)
    (let* ((parser (treesit-parser-create 'bash))
           (root-node (treesit-parser-root-node parser))
           (struct-type (jf/bash-parse--detect-structure-type root-node)))

      (pcase struct-type
        (:pipeline
         (jf/bash-parse--handle-pipeline root-node))
        (:list
         (jf/bash-parse--handle-list root-node))
        (:simple
         (jf/bash-parse--handle-simple-command root-node))
        (_
         (list :success nil
               :error "Unknown command structure"))))))

(defun jf/bash-parse--detect-structure-type (root-node)
  "Detect the structure type from ROOT-NODE.
Returns :pipeline, :list, or :simple."
  (let ((pipeline-node (jf/bash-parse--find-node-by-type root-node "pipeline"))
        (list-node (jf/bash-parse--find-node-by-type root-node "list")))
    (cond
     (pipeline-node :pipeline)
     (list-node :list)
     ;; Check if program has multiple command children (semicolon-separated)
     ((> (jf/bash-parse--count-command-children root-node) 1) :list)
     (t :simple))))

(defun jf/bash-parse--count-command-children (node)
  "Count how many command or redirected_statement children NODE has."
  (let ((count 0))
    (dotimes (i (treesit-node-child-count node))
      (when-let ((child (treesit-node-child node i)))
        (let ((child-type (treesit-node-type child)))
          (when (or (string= child-type "command")
                    (string= child-type "redirected_statement"))
            (setq count (1+ count))))))
    count))

(defun jf/bash-parse--find-node-by-type (node target-type)
  "Find first node of TARGET-TYPE in tree starting from NODE."
  (when node
    (if (string= (treesit-node-type node) target-type)
        node
      (let ((child-count (treesit-node-child-count node))
            (result nil))
        (dotimes (i child-count)
          (when (null result)
            (when-let ((child (treesit-node-child node i)))
              (setq result (jf/bash-parse--find-node-by-type child target-type)))))
        result))))

(defun jf/bash-parse--handle-pipeline (root-node)
  "Handle pipeline command from ROOT-NODE."
  (let* ((pipeline-node (jf/bash-parse--find-node-by-type root-node "pipeline"))
         (command-nodes (jf/bash-parse--get-all-command-nodes pipeline-node))
         (parsed-commands (mapcar #'jf/bash-parse--parse-single-command-node
                                   command-nodes))
         (any-dangerous (seq-some (lambda (cmd) (plist-get cmd :dangerous-p))
                                  parsed-commands)))

    (list :success t
          :type :pipeline
          :all-commands parsed-commands
          :command-count (length parsed-commands)
          :dangerous-p any-dangerous
          :ast root-node)))

(defun jf/bash-parse--handle-list (root-node)
  "Handle command list/chain from ROOT-NODE."
  (let* ((list-node (jf/bash-parse--find-node-by-type root-node "list"))
         ;; Use list-node if found, otherwise use root-node for semicolon-separated commands
         (container-node (or list-node root-node))
         (command-nodes (jf/bash-parse--get-all-command-nodes container-node))
         (parsed-commands (mapcar #'jf/bash-parse--parse-single-command-node
                                   command-nodes))
         (any-dangerous (seq-some (lambda (cmd) (plist-get cmd :dangerous-p))
                                  parsed-commands)))

    (list :success t
          :type :chain
          :all-commands parsed-commands
          :command-count (length parsed-commands)
          :dangerous-p any-dangerous
          :ast root-node)))

(defun jf/bash-parse--handle-simple-command (root-node)
