config/experiments/bash-parser/bash-parser.el

(defun jf/bash-parse--parse-single-command-node (command-or-statement-node)
  "Parse COMMAND-OR-STATEMENT-NODE which may be command or redirected_statement.
Returns command structure with optional :redirections field."
  (let ((command-node nil)
        (redirections nil))

    ;; Check if this is a redirected_statement wrapper
    (if (string= (treesit-node-type command-or-statement-node) "redirected_statement")
        (progn
          ;; Extract the actual command from the body field
          (setq command-node
                (treesit-node-child-by-field-name command-or-statement-node "body"))
          ;; Extract redirections
          (setq redirections
                (jf/bash-parse--extract-redirections command-or-statement-node)))
      ;; Not a redirected statement, use node as-is
      (setq command-node command-or-statement-node))

    ;; Parse command as before
    (let* ((words (jf/bash-parse--extract-words command-node))
           (command-name (car words))
           (remaining-words (cdr words))
           (subcommand (jf/bash-parse--detect-subcommand command-name remaining-words))
           (args-start (if subcommand (cdr remaining-words) remaining-words)))

      ;; Check for wrapper commands (sudo, env, time, etc.)
      (if-let ((wrapper-spec (alist-get (intern command-name)
                                        jf/bash-parser-wrapper-commands)))
          (jf/bash-parse--parse-wrapper-command command-name wrapper-spec remaining-words redirections)

        ;; Check for find command with -exec blocks
        (if (and (string= command-name "find")
                 (or (member "-exec" args-start)
                     (member "-execdir" args-start)))
            (jf/bash-parse--parse-find-with-exec command-name args-start redirections)

          ;; Normal command processing
          (let* ((flags (jf/bash-parse--extract-flags args-start))
                 (positional-args (jf/bash-parse--extract-positional-args args-start))
                 (dangerous-p (jf/bash-parse--is-dangerous command-name subcommand flags)))

            ;; Build result, only include redirections if present
            (let ((result (list :command-name command-name
                               :subcommand subcommand
                               :flags flags
                               :positional-args positional-args
                               :dangerous-p dangerous-p)))
              (when redirections
                (setq result (plist-put result :redirections redirections)))
              result)))))))

(defun jf/bash-parse--extract-words (command-node)
  "Extract all word nodes from COMMAND-NODE as strings.
Returns list of strings representing all words in the command."
  (let ((words '()))
    (jf/bash-parse--visit-node
     command-node
     (lambda (node)
       (let ((node-type (treesit-node-type node)))
         (cond
          ;; Terminal nodes: extract text and skip children to prevent duplication
          ((or (string= node-type "concatenation")
               (string= node-type "string")
               (string= node-type "raw_string")
               (string= node-type "ansi_c_string")
               (string= node-type "simple_expansion")
               (string= node-type "expansion"))
           (let ((text (treesit-node-text node t)))
             (when (and text (> (length text) 0))
               (setq text (string-trim text))
               ;; Remove surrounding quotes for string types (not concatenation/expansion)
               (when (and (> (length text) 1)
                         (not (member node-type '("concatenation" "simple_expansion" "expansion")))
                         (or (and (string-prefix-p "\"" text)
                                  (string-suffix-p "\"" text))
                             (and (string-prefix-p "'" text)
                                  (string-suffix-p "'" text))))
                 (setq text (substring text 1 -1)))
               (unless (string-empty-p text)
                 (push text words))))
           ;; Return :skip-children to prevent recursing into components
           :skip-children)

          ;; Leaf nodes: extract text and continue visiting siblings
          ((or (string= node-type "word")
               (string= node-type "number"))
           (let ((text (treesit-node-text node t)))
             (when (and text (> (length text) 0))
               (setq text (string-trim text))
               (unless (string-empty-p text)
                 (push text words))))
           nil)

          ;; Other nodes: just continue visiting children
          (t nil)))))
    (nreverse words)))
