config/experiments/bash-parser/bash-parser.org
** Variable Reference Detection

Detect variable references in file paths without resolving them. This enables
identification of paths that need context-aware resolution.

#+begin_src emacs-lisp
(defun jf/bash-detect-variable-references (file-path)
  "Detect variable references in FILE-PATH.

Identifies both simple $VAR and braced ${VAR} syntax without resolving them.
Returns cons cell (HAS-VARS . VAR-NAMES) where:
  HAS-VARS - t if any variables found, nil otherwise
  VAR-NAMES - list of variable names (strings) in order of appearance

Supported patterns:
  $VAR       - Simple variable reference
  ${VAR}     - Braced variable reference
  $A/$B/$C   - Multiple variables in path

Examples:
  (jf/bash-detect-variable-references \"/workspace/file.txt\")
    => (nil)
  (jf/bash-detect-variable-references \"$WORKSPACE/file.txt\")
    => (t . (\"WORKSPACE\"))
  (jf/bash-detect-variable-references \"${TEMP_DIR}/output.txt\")
    => (t . (\"TEMP_DIR\"))
  (jf/bash-detect-variable-references \"$SRC/$FILE.txt\")
    => (t . (\"SRC\" \"FILE\"))

Variable names match pattern: [A-Za-z_][A-Za-z0-9_]*"
  (let ((var-names nil))
    (save-match-data
      ;; Match ${VAR} or $VAR patterns
      ;; Group 1: braced variable (${VAR})
      ;; Group 2: simple variable ($VAR)
      (let ((pos 0))
        (while (string-match "\\${\\([A-Za-z_][A-Za-z0-9_]*\\)}\\|\\$\\([A-Za-z_][A-Za-z0-9_]*\\)"
                            file-path pos)
          (let ((var-name (or (match-string 1 file-path)
                             (match-string 2 file-path))))
            (push var-name var-names))
          (setq pos (match-end 0)))))
    ;; Return cons cell: (has-vars . var-names)
    (if var-names
        (cons t (nreverse var-names))
      (cons nil nil))))
#+end_src

** Variable Resolution

Resolve variable references against provided context with support for partial resolution.

#+begin_src emacs-lisp
(defun jf/bash-resolve-variables (file-path var-context)
  "Resolve variables in FILE-PATH using VAR-CONTEXT.

VAR-CONTEXT is an alist mapping variable names (as symbols) to string values:
  ((VAR1 . \"value1\") (VAR2 . \"value2\") ...)

Supports both $VAR and ${VAR} syntax. Performs partial resolution - some variables
may be resolved while others remain unresolved.

Return values:
  - String: All variables resolved successfully
  - Plist: Some variables remain unresolved
    (:path \"partially/resolved/$PATH\" :unresolved (\"PATH\"))

Resolution behavior:
  - Resolved variables: Replaced with their values from context
  - Unresolved variables: Preserved in original syntax ($ or ${})
  - No variables: Returns original path unchanged

Examples:
  ;; All resolved - return simple string
  (jf/bash-resolve-variables \"$WORKSPACE/file.txt\"
                             '((WORKSPACE . \"/workspace\")))
    => \"/workspace/file.txt\"

  ;; Partial resolution - return plist with unresolved list
  (jf/bash-resolve-variables \"$WORKSPACE/$FILE\"
                             '((WORKSPACE . \"/workspace\")))
    => (:path \"/workspace/$FILE\" :unresolved (\"FILE\"))

  ;; No context - mark all as unresolved
  (jf/bash-resolve-variables \"$UNKNOWN/file.txt\" nil)
    => (:path \"$UNKNOWN/file.txt\" :unresolved (\"UNKNOWN\"))

  ;; No variables - return unchanged
  (jf/bash-resolve-variables \"/absolute/path.txt\" nil)
    => \"/absolute/path.txt\"

  ;; Both syntax forms
  (jf/bash-resolve-variables \"$A/${B}/file\" '((A . \"/a\") (B . \"b\")))
    => \"/a/b/file\"

Security note: Unresolved variables should be treated as security risks since
their runtime values cannot be validated against scope constraints."
  (let* ((detection-result (jf/bash-detect-variable-references file-path))
         (has-variables (car detection-result))
         (var-names (cdr detection-result)))

    ;; Fast path: no variables found
    (if (not has-variables)
        file-path

      ;; Process each variable reference
      (let ((resolved file-path)
            (unresolved nil))
        (dolist (var-name var-names)
          (let ((value (alist-get (intern var-name) var-context)))
            (if value
                ;; Replace all occurrences of $VAR or ${VAR} with value
                ;; Use word boundary \\b for $VAR to prevent partial matches
                ;; (e.g., matching $VAR when the variable is $VARIABLE)
                (setq resolved
                      (replace-regexp-in-string
                       (format "\\${%s}\\|\\$%s\\b" var-name var-name)
                       value
                       resolved
                       t  ; fixedcase - preserve case
                       t)) ; literal - treat replacement string literally
              ;; Track unresolved variable
              (push var-name unresolved))))

        ;; Return format based on resolution status
        (if unresolved
            ;; Partial or no resolution - return plist with metadata
            (list :path resolved :unresolved (nreverse unresolved))
          ;; Full resolution - return simple string
          resolved)))))
#+end_src

** Variable Assignment Tracking

Track simple variable assignments (VAR=value) in command structures for sequential resolution.

#+begin_src emacs-lisp
(defun jf/bash-track-assignments (parsed-command &optional initial-context)
  "Track variable assignments from PARSED-COMMAND, merging with INITIAL-CONTEXT.

Extracts simple VAR=value assignments from the parsed command structure and
builds a variable context alist mapping variable names (as symbols) to their
values (as strings).

PARSED-COMMAND is the output of `jf/bash-parse'.
INITIAL-CONTEXT is an optional alist of existing variable bindings.

Returns updated context alist with new assignments merged.

Supported patterns:
- Simple assignment: VAR=value
- Assignment before command: DIR=/tmp cat $DIR/file
- Command chains: A=1 && B=2 && cmd (accumulates left-to-right)

Unsupported (returns unchanged context):
- Complex expansions: ${VAR:-default}
- Arrays: ARR=(a b c)
- Command substitution: VAR=$(cmd)

Examples:
  (jf/bash-track-assignments
    (jf/bash-parse \"DIR=/tmp && cat $DIR/file.txt\")
    nil)
  => ((DIR . \"/tmp\"))

  (jf/bash-track-assignments
    (jf/bash-parse \"A=/foo && B=$A/bar\")
    ((WORKSPACE . \"/workspace\")))
  => ((B . \"$A/bar\") (A . \"/foo\") (WORKSPACE . \"/workspace\"))

Implementation note:
  Assignments are detected by checking if the command name or positional
  arguments match the VAR=value pattern. Tree-sitter may parse these as
  variable_assignment nodes or include them in the word list depending on
  command structure."
  (let ((context (copy-alist initial-context))
        (command-type (plist-get parsed-command :type))
        (all-commands (plist-get parsed-command :all-commands)))

    (cond
     ;; Chain or pipeline: process all commands in order
     ((or (eq command-type :chain) (eq command-type :pipeline))
      (dolist (cmd all-commands)
        (when-let ((assignments (jf/bash--extract-assignments-from-command cmd)))
          ;; Prepend assignments to maintain left-to-right precedence
          (setq context (append assignments context)))))

     ;; Simple command: check for assignments
     ((eq command-type :simple)
      (when-let ((assignments (jf/bash--extract-assignments-from-command parsed-command)))
        (setq context (append assignments context)))))

    context))
#+end_src

** Extract Assignments from Single Command

Helper function to extract variable assignments from a single command structure.

#+begin_src emacs-lisp
(defun jf/bash--extract-assignments-from-command (command)
  "Extract variable assignments from COMMAND structure.

COMMAND is a single parsed command (from :all-commands or a simple command).

Returns alist of (VAR-SYMBOL . VALUE-STRING) for each assignment found,
or nil if no assignments detected.

Detects assignments by checking if the command name matches the pattern
VAR=value. Tree-sitter parses these as variable_assignment nodes, but
they may also appear in the word list.

This function only handles simple assignments (no complex expansions).

Examples:
  ;; Assignment as command
  (jf/bash--extract-assignments-from-command
    (:command-name \"DIR=/tmp\" :subcommand nil ...))
  => ((DIR . \"/tmp\"))

  ;; No assignment
  (jf/bash--extract-assignments-from-command
    (:command-name \"cat\" :positional-args (\"file.txt\") ...))
  => nil

  ;; Assignment in positional args
  (jf/bash--extract-assignments-from-command
    (:command-name \"env\" :positional-args (\"VAR=value\" \"cmd\") ...))
  => ((VAR . \"value\"))"
  (let ((assignments nil)
        (command-name (plist-get command :command-name))
        (positional-args (plist-get command :positional-args)))

    ;; Check if command-name itself is an assignment (VAR=value)
    (when (and command-name (string-match "^\\([A-Za-z_][A-Za-z0-9_]*\\)=\\(.+\\)$" command-name))
      (let ((var-name (match-string 1 command-name))
            (var-value (match-string 2 command-name)))
        (push (cons (intern var-name) var-value) assignments)))

    ;; Also check positional args for assignment patterns
    ;; (in case tree-sitter includes them there)
    (dolist (arg positional-args)
      (when (string-match "^\\([A-Za-z_][A-Za-z0-9_]*\\)=\\(.+\\)$" arg)
        (let ((var-name (match-string 1 arg))
              (var-value (match-string 2 arg)))
          (push (cons (intern var-name) var-value) assignments))))

    (nreverse assignments)))
#+end_src

* File Operations Extraction

Extract file operations from parsed bash command structures with high confidence.
This system enables security validation by identifying which files a command will
read, write, delete, or modify.

** Main Extraction Function

The public API for file operation extraction. Orchestrates all extraction sources
and handles deduplication.

#+begin_src emacs-lisp
(defun jf/bash-extract-file-operations (parsed-command &optional var-context)
  "Extract all file operations from PARSED-COMMAND.

This is the main entry point for file operation extraction. It coordinates
extraction from all sources:
- Redirections (>, >>, <, 2>, etc.)
- Positional arguments (based on command semantics)
- Exec blocks (find -exec ... \\;)

PARSED-COMMAND is the output from `jf/bash-parse'.
VAR-CONTEXT is an optional alist mapping variable names (symbols) to values (strings).

Returns a list of operation plists, each containing:
  :file - File path (may contain unresolved variables)
  :operation - Operation type (:read, :write, :delete, :modify, :create, :append)
  :confidence - Confidence level (:high, :medium, :low, :unknown)
  :source - Source of operation (:redirection, :positional-arg, :exec-block)
  :indirect - t if from nested command (optional)
  :unresolved - List of unresolved variable names (optional)

Handles multi-command constructs:
- Pipelines: Extract from each command in the pipeline
- Chains: Extract from each command, tracking variable assignments
- Simple: Extract from the single command

Operations are deduplicated: if the same file appears with the same operation
type multiple times, only one entry is returned.

Examples:
  ;; Simple read
  (jf/bash-extract-file-operations
    (jf/bash-parse \"cat /workspace/file.txt\"))
  => ((:file \"/workspace/file.txt\" :operation :read
       :confidence :high :source :positional-arg))

  ;; Multiple sources
  (jf/bash-extract-file-operations
    (jf/bash-parse \"cat input.txt > output.txt\"))
  => ((:file \"input.txt\" :operation :read :confidence :high :source :positional-arg)
      (:file \"output.txt\" :operation :write :confidence :high :source :redirection))

  ;; Pipeline
  (jf/bash-extract-file-operations
    (jf/bash-parse \"cat file.txt | grep pattern > output.txt\"))
  => ((:file \"file.txt\" :operation :read ...)
      (:file \"output.txt\" :operation :write ...))

  ;; Variable resolution
  (jf/bash-extract-file-operations
    (jf/bash-parse \"cat $WORKSPACE/file.txt\")
    '((WORKSPACE . \"/workspace\")))
  => ((:file \"/workspace/file.txt\" :operation :read ...))"
  (let ((operations nil)
        (context (or var-context nil))
        (command-type (plist-get parsed-command :type))
        (all-commands (plist-get parsed-command :all-commands)))

    (cond
     ;; Chain: process sequentially, tracking variable assignments
     ((eq command-type :chain)
      (dolist (cmd all-commands)
        ;; Track assignments from this command
        (setq context (jf/bash-track-assignments cmd context))
        ;; Extract operations from this command
        (let ((cmd-ops (jf/bash--extract-from-single-command cmd context)))
          (setq operations (append operations cmd-ops)))))

     ;; Pipeline: process each command independently
     ((eq command-type :pipeline)
      (dolist (cmd all-commands)
        (let ((cmd-ops (jf/bash--extract-from-single-command cmd context)))
          (setq operations (append operations cmd-ops)))))

     ;; Simple: extract from single command
     ((eq command-type :simple)
      (setq operations (jf/bash--extract-from-single-command parsed-command context))))

    ;; Deduplicate: same file + operation
    (jf/bash--deduplicate-operations operations)))
#+end_src

*** Extract from Single Command

Helper to extract operations from a single command structure.

#+begin_src emacs-lisp
(defun jf/bash--extract-from-single-command (command var-context)
  "Extract file operations from a single COMMAND with VAR-CONTEXT.

COMMAND is a single parsed command structure (from :all-commands or top-level).
VAR-CONTEXT is an alist of variable bindings.

Returns list of operation plists from all extraction sources."
  (let ((operations nil))
    ;; Extract from redirections (high confidence)
    (when-let ((redir-ops (jf/bash-extract-operations-from-redirections command var-context)))
      (setq operations (append operations redir-ops)))

    ;; Extract from positional arguments (command semantics)
    (when-let ((pos-ops (jf/bash-extract-operations-from-positional-args command var-context)))
      (setq operations (append operations pos-ops)))

    ;; Extract from exec blocks (find -exec)
    (when-let ((exec-ops (jf/bash-extract-from-exec-blocks command var-context)))
      (setq operations (append operations exec-ops)))

    operations))
#+end_src

